# BuiltInFailures.TextFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TextFailures Class
BuiltInFailures Class Members See Also
---
Failures about Text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class TextFailures
```

Visual Basic
---
```text
Public NotInheritable Class TextFailures
```

Visual C++
---
```text
public ref class TextFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..TextFailures
# See Also
BuiltInFailures..::..TextFailures Members
Autodesk.Revit.DB Namespace